# Задача 32: Определить индексы элементов массива
# (списка), значения которых принадлежат 
# заданному диапазону (т.е. не меньше заданного 
# минимума и не больше заданного максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]  
# Вывод: [1, 9, 13, 14, 19]

nums = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
min_number = int(input("Введите минимум: "))
max_number = int(input("Введите максимум: "))
indexes = []

for i in range(len(nums)):
    if min_number < nums[i] < max_number:
        indexes.append(i)
        
print(indexes)

